mgo-tec/ESP32_LCD_ILI9341_SPI/src/ESP32_LCD_ILI9341_SPI.cpp
/*
  ESP32_LCD_ILI9341_SPI.cpp - for Arduino core for the ESP32 ( Use SPI library ).
  Beta version 1.27
  
The MIT License (MIT)

Copyright (c) 2018 Mgo-tec. All rights reserved.
Blog URL ---> https://www.mgo-tec.com

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

Modify Display.cpp of M5stack library.
M5stack library - MIT License
Copyright (c) 2017 M5Stack
*/

#include "ESP32_LCD_ILI9341_SPI.h"

ESP32_LCD_ILI9341_SPI::ESP32_LCD_ILI9341_SPI(int8_t sck, int8_t miso, int8_t mosi, int8_t cs, int8_t dc, int8_t rst, int8_t led)
  :_sck(sck)
  , _miso(miso)
  , _mosi(mosi)
  , _cs(cs)
  , _dc(dc)
  , _rst(rst)
  , _ledpin(led)
{}

//************ ILI9341 初期化 ********************
void ESP32_LCD_ILI9341_SPI::ILI9341_Init(){
  ESP32_LCD_ILI9341_SPI::ILI9341_Init(true, 27000000);
}
//************ ILI9341 初期化 ********************
void ESP32_LCD_ILI9341_SPI::ILI9341_Init(uint32_t clk){
  ESP32_LCD_ILI9341_SPI::ILI9341_Init(true, clk);
}
//****** LCD ILI9341 ディスプレイ初期化 ***********
void ESP32_LCD_ILI9341_SPI::ILI9341_Init(bool hwcs, uint32_t clk){
  ESP32_LCD_ILI9341_SPI::Brightness(0);

  _Hw_cs = hwcs;
  _freq = clk;
  _txt_H_max = _Max_Width_x / 8;
  
  //ILI9342C を判別するためのリセットピン読み取り
  pinMode(_rst, INPUT_PULLDOWN);
  delay(1);
  mp_isIPS_lcd = digitalRead(_rst);
  delay(1);

  pinMode(_rst, OUTPUT); //Set RESET pin
  pinMode(_dc, OUTPUT); //Set Data/Command pin

  SPI.begin(_sck, _miso, _mosi, _cs); //VSPI setting

  SPI.setBitOrder(MSBFIRST);
  //ILI9341 のSPI Clock Cycle Time (Write) Minimun 100ns=10MHz
  SPI.setFrequency(clk);
  SPI.setDataMode(SPI_MODE0);
  SPI.setHwCs(_Hw_cs); //Set Hardware CS pin

  //Hardware Reset------------
  digitalWrite(_rst, HIGH);
  delay(5);
  digitalWrite(_rst, LOW);
  delay(10);
  digitalWrite(_rst, HIGH);
  delay(121);

  if(!_Hw_cs){
    pinMode(_cs, OUTPUT);
    digitalWrite(_cs, HIGH);
    digitalWrite(_cs, LOW);
  }
  digitalWrite(_dc, HIGH);

  ESP32_LCD_ILI9341_SPI::CommandWrite(0x38); //Idle mode OFF
  ESP32_LCD_ILI9341_SPI::CommandWrite(0x3A); //COLMOD: Pixel Format Set
    ESP32_LCD_ILI9341_SPI::DataWrite(0b01010101); //RGB 16 bits / pixel, MCU 16 bits / pixel
  ESP32_LCD_ILI9341_SPI::CommandWrite(0x36); //MADCTL: Memory Access Control
    ESP32_LCD_ILI9341_SPI::DataWrite(0b0001000); //M5stack only. D3: BGR(RGB-BGR Order control bit )="1"
    //ESP32_LCD_ILI9341_SPI::DataWrite(0b00101000); //サインスマート 2.2インチ用。D3: BGR(RGB-BGR Order control bit )="1"
  
  if(mp_isIPS_lcd) {
    ESP32_LCD_ILI9341_SPI::CommandWrite(0x21); //Display Inversion ON
  }else{
    ESP32_LCD_ILI9341_SPI::CommandWrite(0x20); //Display Inversion OFF
  }
  
  ESP32_LCD_ILI9341_SPI::CommandWrite(0x11); //Sleep OUT
  delay(10);

  ESP32_LCD_ILI9341_SPI::CommandWrite(0x29); //Display ON

  ESP32_LCD_ILI9341_SPI::Display_Clear(0, 0, 319, 239);

  if(!_Hw_cs) digitalWrite(_cs, HIGH);
  ESP32_LCD_ILI9341_SPI::Brightness(100);
}
//********* 4wire SPI Data / Command write************
void ESP32_LCD_ILI9341_SPI::Disp_Rotation(uint8_t rot){
  uint8_t b = 0b0001000;
  switch( rot ){
    case 0:
      b = 0b0001000;
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      break;
    case 1:
      b = 0b10101000;
      _Max_Width_x = 240;
      _Max_Width_y = 320;
      break;
    case 2: //M5stack 横表示、上下逆
      b = 0b11001000;
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      break;
    case 3: //M5stack 縦表示、上下逆
      b = 0b01101000;
      _Max_Width_x = 240;
      _Max_Width_y = 320;
      break;
    //------------------------
    case 4: //M5stack 横表示、左右反転
      b = 0b01001000;
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      break;
    case 5: //M5stack 縦表示、左右反転
      b = 0b00101000;
      _Max_Width_x = 240;
      _Max_Width_y = 320;
      break;
    case 6: //M5stack 横表示、上下逆、左右反転
      b = 0b10001000;
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      break;
    case 7: //M5stack 縦表示、上下逆、左右反転
      b = 0b11101000;
      _Max_Width_x = 240;
      _Max_Width_y = 320;
      break;
    //-------------------------------
    case 8: //M5stack 横表示、デフォルト、上下反転
      b = 0b10001000;
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      break;
    case 9: //M5stack 縦表示、デフォルト、上下反転
      b = 0b11101000;
      _Max_Width_x = 240;
      _Max_Width_y = 320;
      break;
    case 10: //M5stack 横表示、上下逆、上下反転
      b = 0b01001000;
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      break;
    case 11: //M5stack 縦表示、上下逆、上下反転
      b = 0b00101000;
      _Max_Width_x = 240;
      _Max_Width_y = 320;
      break;
    //-------------------------------
    case 12: //M5stack で表示変わらず
      b = 0b00001100;
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      break;
    case 13: //M5stack で表示変わらず
      b = 0b00011000;
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      break;

    //------------------------
    case 250:
      b = 0b00101000; //ESP32_mgo_tec bv1.0.69 HiLetgo 2.8", サインスマート販売のILI9341横正常表示
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      break;
    case 251:
      b = 0b10001000; //ESP32_mgo_tec bv1.0.69 HiLetgo 2.8", サインスマート販売のILI9341の縦方向表示
      _Max_Width_x = 240;
      _Max_Width_y = 320;
      break;
    case 252: //ESP32_mgo_tec bv1.0.69 HiLetgo 2.8"　横表示　上下逆
      b = 0b11101000;
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      break;
    case 253: //ESP32_mgo_tec bv1.0.69 HiLetgo 2.8"、 縦表示　上下逆
      b = 0b01001000;
      _Max_Width_x = 240;
      _Max_Width_y = 320;
      break;
    case 254:
      b = 0b00101000; //ESP32_mgo_tec bv1.0.71～ HiLetgo 2.8" 横正常表示
      _Max_Width_x = 320;
      _Max_Width_y = 240;
      ESP32_LCD_ILI9341_SPI::dispInversionOn();
      break;
    default:
      break;
  }
  _Max_Pix_X = _Max_Width_x - 1;
  _Max_Pix_Y = _Max_Width_y - 1;
  _txt_H_max = _Max_Width_x / 8;
  ESP32_LCD_ILI9341_SPI::SPI_set_change();
  ESP32_LCD_ILI9341_SPI::CommandWrite(0x36); //MADCTL: Memory Access Control
    ESP32_LCD_ILI9341_SPI::DataWrite(b); //M5stack only. D3: BGR(RGB-BGR Order control bit )="1"
  if(!_Hw_cs) digitalWrite(_cs, HIGH);
}
//********* Color bit Inversion ON ************
void ESP32_LCD_ILI9341_SPI::dispInversionOn(){
  ESP32_LCD_ILI9341_SPI::SPI_set_change();
  if(mp_isIPS_lcd) {
    ESP32_LCD_ILI9341_SPI::CommandWrite(0x20); //Display Inversion OFF
  }else{
    ESP32_LCD_ILI9341_SPI::CommandWrite(0x21); //Display Inversion ON
  }
  if(!_Hw_cs) digitalWrite(_cs, HIGH);
}
//********* Color bit Inversion OFF ************
void ESP32_LCD_ILI9341_SPI::dispInversionOff(){
  ESP32_LCD_ILI9341_SPI::SPI_set_change();
  if(mp_isIPS_lcd) {
    ESP32_LCD_ILI9341_SPI::CommandWrite(0x21); //Display Inversion ON
  }else{
    ESP32_LCD_ILI9341_SPI::CommandWrite(0x20); //Display Inversion OFF
  }
  if(!_Hw_cs) digitalWrite(_cs, HIGH);
}
//********* 4wire SPI Data / Command write************
void ESP32_LCD_ILI9341_SPI::CommandWrite(uint8_t b){
  digitalWrite(_dc, LOW);
  SPI.write(b);
  digitalWrite(_dc, HIGH);
}

void ESP32_LCD_ILI9341_SPI::DataWrite(uint8_t b){
  SPI.write(b);
}

void ESP32_LCD_ILI9341_SPI::DataWrite16(uint16_t b){
  SPI.write16(b);
}

void ESP32_LCD_ILI9341_SPI::DataWrite32(uint32_t b){
  SPI.write32(b);
}

void ESP32_LCD_ILI9341_SPI::DataWriteBytes(uint8_t *b, uint32_t b_size){
  //ESP32_LCD_ILI9341_SPI::CommandWrite( 0x2C ); //RAM write
  SPI.writeBytes(b, b_size);
}
//**************************************************
void ESP32_LCD_ILI9341_SPI::SPI_set_change(){
  SPI.setFrequency(_freq);
  SPI.setDataMode(SPI_MODE0);
  if(!_Hw_cs) digitalWrite(_cs, LOW);
}
//******** Set Column and Page Address ( X Y range setting )***********
void ESP32_LCD_ILI9341_SPI::XY_Range(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1){
  uint32_t X = (uint32_t)x0<<16 | x1;
  uint32_t Y = (uint32_t)y0<<16 | y1;

