mgo-tec/ESP32_LCD_ILI9341_SPI/src/ESP32_LCD_ILI9341_SPI.cpp
  ESP32_LCD_ILI9341_SPI::CommandWrite( 0x2A ); //Set Column Address
    ESP32_LCD_ILI9341_SPI::DataWrite32(X);
  ESP32_LCD_ILI9341_SPI::CommandWrite( 0x2B ); //Set Page Address
    ESP32_LCD_ILI9341_SPI::DataWrite32(Y);
}
//**********スクロールセットアップ*******************
void ESP32_LCD_ILI9341_SPI::Scrolle_Font_SetUp(uint8_t num, uint8_t txt_width, uint8_t red, uint8_t green, uint8_t blue, uint8_t bg_red, uint8_t bg_green, uint8_t bg_blue, uint16_t x0, uint16_t y0, uint8_t H_size, uint8_t V_size, bool xy_range_set ){
  _X0 = x0;
  _Y0 = y0;
  ESP32_LCD_ILI9341_SPI::Scrolle_Font_SetUp(num, txt_width, 40, H_size, V_size, 10, red, green, blue, bg_red, bg_green, bg_blue, xy_range_set);
}
//**********スクロールセットアップ*******************
void ESP32_LCD_ILI9341_SPI::Scrolle_Font_SetUp(uint8_t num, uint8_t txt_width, uint16_t txt_length, uint8_t red, uint8_t green, uint8_t blue, uint8_t bg_red, uint8_t bg_green, uint8_t bg_blue, uint16_t x0, uint16_t y0, uint8_t H_size, uint8_t V_size, bool xy_range_set ){
  _X0 = x0;
  _Y0 = y0;
  ESP32_LCD_ILI9341_SPI::Scrolle_Font_SetUp(num, txt_width, txt_length, H_size, V_size, 10, red, green, blue, bg_red, bg_green, bg_blue, xy_range_set);
}
//**********スクロールセットアップ*******************
void ESP32_LCD_ILI9341_SPI::Scrolle_Font_SetUp(uint8_t num, uint8_t txt_width, uint16_t txt_length, uint8_t H_size, uint8_t V_size, uint32_t scl_speed, uint8_t red, uint8_t green, uint8_t blue, uint8_t bg_red, uint8_t bg_green, uint8_t bg_blue, bool xy_range_set){
  _txt_length[num] = txt_length;
  _H_Size[num] = H_size;
  _V_Size[num] = V_size;

  _Dot_MSB[num] = (red << 3) | (green >> 3);
  _Dot_LSB[num] = (green << 5) | blue;

  if( (bg_red + bg_green + bg_blue) != 0 ){
    _BG_Dot_MSB[num] = (bg_red << 3) | (bg_green >> 3);
    _BG_Dot_LSB[num] = (bg_green << 5) | bg_blue;
  }

  if(_H_Size[num] > 15) _H_Size[num] = 15;
  if(_V_Size[num] > 15) _V_Size[num] = 15;
  if(txt_width > 40){
    _txt_width = 40;
  }else{
    _txt_width = txt_width;
  }

  _tmp_width1[num] = txt_width * ( 8 * _H_Size[num] );
  if( _tmp_width1[num] > _Max_Width_x ) _tmp_width1[num] = _Max_Width_x;

  _H_pix_max[num] = _tmp_width1[num] - 1;

  if( xy_range_set ){
    ESP32_LCD_ILI9341_SPI::SPI_set_change();
    ESP32_LCD_ILI9341_SPI::XY_Range(_X0, _Y0, _X0 + _H_pix_max[num], _Y0 + 16 * _V_Size[num] - 1);
    ESP32_LCD_ILI9341_SPI::CommandWrite( 0x2C ); //RAM write
    if(!_Hw_cs) digitalWrite(_cs, HIGH);
  }
}
//********* Scrolle X-Y Range Command Chagne *********
void ESP32_LCD_ILI9341_SPI::Scrolle_XYrange_Com_Change(uint8_t num){
  ESP32_LCD_ILI9341_SPI::Scrolle_XYrange_Com_Change(num, _X0, _Y0);
}
//********* Scrolle X-Y Range Command Chagne *********
void ESP32_LCD_ILI9341_SPI::Scrolle_XYrange_Com_Change(uint8_t num, uint16_t x0, uint16_t y0){
  ESP32_LCD_ILI9341_SPI::SPI_set_change();
  ESP32_LCD_ILI9341_SPI::XY_Range(x0, y0, x0 + _H_pix_max[num], y0 + 16 * _V_Size[num] - 1);
  ESP32_LCD_ILI9341_SPI::CommandWrite( 0x2C ); //RAM write
  if(!_Hw_cs) digitalWrite(_cs, HIGH);
}
//********* FAST スクロール ********************
void ESP32_LCD_ILI9341_SPI::Scrolle_HVsizeUp_8x16_Font_DisplayOut(uint8_t num, uint32_t scl_speed, uint8_t H_size, uint8_t V_size, uint8_t Fnt[][16], uint8_t scl_buf[][640]){
  ESP32_LCD_ILI9341_SPI::Scrolle_HVsizeUp_8x16_Font_DisplayOut(num, scl_speed, H_size, V_size, &_scl_cnt[num], &_fnt_cnt[num], _txt_length[num], _X0, _Y0, Fnt, scl_buf, true);
}
//********* スクロール ********************
void ESP32_LCD_ILI9341_SPI::Scrolle_HVsizeUp_8x16_Font_DisplayOut(uint8_t num, uint16_t x0, uint16_t y0, uint8_t Fnt[][16], uint8_t scl_buf[][640]){
  ESP32_LCD_ILI9341_SPI::Scrolle_HVsizeUp_8x16_Font_DisplayOut(num, &_scl_cnt[num], &_fnt_cnt[num], x0, y0, Fnt, scl_buf);
}
//********* スクロール ********************
void ESP32_LCD_ILI9341_SPI::Scrolle_HVsizeUp_8x16_Font_DisplayOut(uint8_t num, uint32_t scl_speed, uint8_t H_size, uint8_t V_size, uint16_t x0, uint16_t y0, uint8_t Fnt[][16], uint8_t scl_buf[][640]){
  ESP32_LCD_ILI9341_SPI::Scrolle_HVsizeUp_8x16_Font_DisplayOut(num, scl_speed, H_size, V_size, &_scl_cnt[num], &_fnt_cnt[num], _txt_length[num], x0, y0, Fnt, scl_buf);
}
//********* スクロール ********************
void ESP32_LCD_ILI9341_SPI::Scrolle_HVsizeUp_8x16_Font_DisplayOut(uint8_t num, uint32_t scl_speed, uint8_t H_size, uint8_t V_size, int8_t *scl_cnt, uint16_t *fnt_cnt, uint16_t txt_length, uint16_t x0, uint16_t y0, uint8_t Fnt[][16], uint8_t scl_buf[][640], bool xy_range_set){
  _scl_speed[num] = scl_speed;
  _H_Size[num] = H_size;
  _V_Size[num] = V_size;
  _txt_length[num] = txt_length;
  _tmp_width1[num] = _txt_width * ( 8 * _H_Size[num] );
  if( _tmp_width1[num] > _Max_Width_x ) _tmp_width1[num] = _Max_Width_x;
  _H_pix_max[num] = _tmp_width1[num] - 1;

  ESP32_LCD_ILI9341_SPI::Scrolle_HVsizeUp_8x16_Font_DisplayOut(num, scl_cnt, fnt_cnt, x0, y0, Fnt, scl_buf, xy_range_set);
}

//********* スクロール ********************
void ESP32_LCD_ILI9341_SPI::Scrolle_HVsizeUp_8x16_Font_DisplayOut(uint8_t num, int8_t *scl_cnt, uint16_t *fnt_cnt, uint16_t x0, uint16_t y0, uint8_t Fnt[][16], uint8_t scl_buf[][640], bool xy_range_set){
  if( millis() - _scl_LastTime[num] > _scl_speed[num]){
    ESP32_LCD_ILI9341_SPI::SPI_set_change();
    uint16_t array_max = (_tmp_width1[num] ) * 2;
    uint8_t bt1 = 0b10000000;
    int i, j;

    if( xy_range_set ){
      ESP32_LCD_ILI9341_SPI::XY_Range(x0, y0, x0 + _H_pix_max[num], y0 + 16 * _V_Size[num] - 1);
      ESP32_LCD_ILI9341_SPI::CommandWrite( 0x2C ); //RAM write
    }

    uint16_t b2 = array_max - _scl_pix_cnt[num];
    for(i = 0; i < 16; i++){
      for(j = _V_Size[num]; j > 0; j--){
        ESP32_LCD_ILI9341_SPI::DataWriteBytes(&scl_buf[i][_prev_scl_pix_cnt[num]], b2);
        ESP32_LCD_ILI9341_SPI::DataWriteBytes(scl_buf[i], _scl_pix_cnt[num]);
      }
    }

    if( _scl_pix_cnt[num] < (array_max - _H_Size[num] * 2) ){
      _prev_scl_pix_cnt[num] = _prev_scl_pix_cnt[num] + _H_Size[num] * 2;
    }else{
      _prev_scl_pix_cnt[num] = 0; //ポインタをゼロにリセット
    }

    uint16_t count;
    for(i = 0; i < 16; i++){
      count = _scl_pix_cnt[num];
      if( Fnt[*fnt_cnt][i] & (bt1 >> *scl_cnt) ){
        for( j = _H_Size[num]; j > 0; j-- ){
          scl_buf[i][count++] = _Dot_MSB[num];
          scl_buf[i][count++] = _Dot_LSB[num];
          if(count >= array_max) break;
        }
      }else{
        for( j = _H_Size[num]; j > 0; j-- ){
          scl_buf[i][count++] = _BG_Dot_MSB[num];
          scl_buf[i][count++] = _BG_Dot_LSB[num];
          if(count >= array_max) break;
        }
      }
    }
    _scl_pix_cnt[num] = count;

    if( _scl_pix_cnt[num] >= array_max ) _scl_pix_cnt[num] = 0;

    if( ++(*scl_cnt) > 7 ){
      *scl_cnt = 0;
      if( ++(*fnt_cnt) >= _txt_length[num] ) {
        *fnt_cnt = 0;
      }
    }
    _scl_LastTime[num] = millis();
    if(!_Hw_cs) digitalWrite(_cs, HIGH);
  }
}
//********* FAST 1文字づつ読み込みスクロール ********************
boolean ESP32_LCD_ILI9341_SPI::Scrolle_Inc_HVsizeUp_8x16_Font_DisplayOut(uint8_t num, uint8_t zen_or_han, uint32_t scl_speed, uint8_t H_size, uint8_t V_size, int8_t *scl_cnt, uint16_t txt_length, uint8_t Fnt[][16], uint8_t scl_buf[][640]){
  return ESP32_LCD_ILI9341_SPI::Scrolle_Inc_HVsizeUp_8x16_Font_DisplayOut(num, zen_or_han, scl_speed, H_size, V_size, scl_cnt, txt_length, _X0, _Y0, Fnt, scl_buf, false);
}
//********* 1文字づつ読み込みスクロール ********************
boolean ESP32_LCD_ILI9341_SPI::Scrolle_Inc_HVsizeUp_8x16_Font_DisplayOut(uint8_t num, uint8_t zen_or_han, uint32_t scl_speed, uint8_t H_size, uint8_t V_size, int8_t *scl_cnt, uint16_t txt_length, uint16_t x0, uint16_t y0, uint8_t Fnt[][16], uint8_t scl_buf[][640], bool xy_range_set){
  boolean ret = false;

  ESP32_LCD_ILI9341_SPI::Scrolle_HVsizeUp_8x16_Font_DisplayOut(num, scl_speed, H_size, V_size, scl_cnt, &_zen_or_han_cnt[ num ], txt_length, x0, y0, Fnt, scl_buf, xy_range_set);

  if((zen_or_han == 2) && (_zen_or_han_cnt[ num ] == 2)){
    _zen_or_han_cnt[ num ] = 0;
    ret = true;
  }else if((zen_or_han == 1) && (_zen_or_han_cnt[ num ] == 1)){
    _zen_or_han_cnt[ num ] = 0;
    ret = true;
  }

  return ret;
}
//********* OLED 8x16フォント　サイズアップ　出力 バックグラウンドカラー有り********************
void ESP32_LCD_ILI9341_SPI::HVsizeUp_8x16_Font_DisplayOut(uint8_t H_Size, uint8_t V_Size, uint16_t txt_length, uint16_t x0, uint16_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t Fnt[][16], uint8_t bg_red, uint8_t bg_green, uint8_t bg_blue ){
  ESP32_LCD_ILI9341_SPI::SPI_set_change();

  if(H_Size > 16) H_Size = 16;
  if(V_Size > 16) V_Size = 16;

  uint8_t X_txt_MAX = (uint8_t)ceilf( (float)_txt_H_max / (float)H_Size );
  if( txt_length > X_txt_MAX) txt_length = X_txt_MAX;

