mgo-tec/ESP32_LCD_ILI9341_SPI/src/ESP32_LCD_ILI9341_SPI.cpp
  uint8_t bt = 0b00000001;
  uint8_t dot_MSB = (red << 3) | (green >> 3);
  uint8_t dot_LSB = (green << 5) | blue;

  uint8_t bg_dot_MSB = 0;
  uint8_t bg_dot_LSB = 0;
  if( (bg_red + bg_green + bg_blue) != 0 ){
    bg_dot_MSB = (bg_red << 3) | (bg_green >> 3);
    bg_dot_LSB = (bg_green << 5) | bg_blue;
  }

  uint8_t disp_byte[(txt_length * 8 * H_Size) * 2] = {};
  uint16_t byte_cnt = 0;
  uint16_t X_pix_cnt = x0, Y_pix_cnt = y0;
  uint16_t Y_tmp_range = 0;

  int i, j, k, ii, jj;
  for(i = 0; i < 16; i++){
    for(j = 0; j < txt_length; j++){
      for( k = 7; k >= 0; k--){
        if( Fnt[j][i] & (bt << k) ){
          for(ii = H_Size; ii > 0; ii--){
            disp_byte[byte_cnt++] = dot_MSB;
            disp_byte[byte_cnt++] = dot_LSB;
            X_pix_cnt++;
            if(X_pix_cnt > _Max_Pix_X) goto max_pixX;
          }
        }else{
          for(ii = H_Size; ii > 0; ii--){
            disp_byte[byte_cnt++] = bg_dot_MSB;
            disp_byte[byte_cnt++] = bg_dot_LSB;
            X_pix_cnt++;
            if(X_pix_cnt > _Max_Pix_X) goto max_pixX;
          }
        }
      }
    }
max_pixX:
    Y_tmp_range = Y_pix_cnt + V_Size -1;
    if(Y_tmp_range > _Max_Pix_Y) Y_tmp_range = _Max_Pix_Y;
    ESP32_LCD_ILI9341_SPI::XY_Range(x0, Y_pix_cnt, X_pix_cnt - 1, Y_tmp_range);
    ESP32_LCD_ILI9341_SPI::CommandWrite( 0x2C ); //RAM write
    for(jj = 0; jj < V_Size; jj++){
      ESP32_LCD_ILI9341_SPI::DataWriteBytes(disp_byte, byte_cnt);
      Y_pix_cnt++;
      if(Y_pix_cnt > _Max_Pix_Y) goto exit;
    }
    X_pix_cnt = x0;
    byte_cnt = 0;
  }
exit:
  if(!_Hw_cs) digitalWrite(_cs, HIGH);
}
//********* LCD ILE9341 8x16 font 1line display out ********************
void ESP32_LCD_ILI9341_SPI::Font_8x16_DisplayOut(uint16_t txt_length, uint16_t x0, uint16_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t Fnt[][16]){
  ESP32_LCD_ILI9341_SPI::HVsizeUp_8x16_Font_DisplayOut(1, 1, txt_length, x0, y0, red, green, blue, Fnt);
}
//********* Display All Black Clear ******************************
void ESP32_LCD_ILI9341_SPI::Display_Clear(){
  ESP32_LCD_ILI9341_SPI::Display_Clear(0, 0, _Max_Pix_X, _Max_Pix_Y);
}
//********* Display All Black Clear ******************************
void ESP32_LCD_ILI9341_SPI::Display_Clear(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1){
  if( x0 > _Max_Pix_X ) x0 = _Max_Pix_X;
  if( y0 > _Max_Pix_Y ) y0 = _Max_Pix_Y;
  if( x1 > _Max_Pix_X ) x1 = _Max_Pix_X;
  if( y1 > _Max_Pix_Y ) y1 = _Max_Pix_Y;
  uint32_t Total_Pixels = (x1 - x0 + 1) * (y1 - y0 + 1) ;
  ESP32_LCD_ILI9341_SPI::Block_SPI_Fast_Write(x0, y0, x1, y1, 0, 0, 0, Total_Pixels);
}
//*********** LCD ILE9341 Block Pixel SPI Fast Write *****************
void ESP32_LCD_ILI9341_SPI::Block_SPI_Fast_Write(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint8_t red, uint8_t green, uint8_t blue, uint32_t repeat){
  ESP32_LCD_ILI9341_SPI::SPI_set_change();
  uint16_t ColorDot = (red << 11) | (green << 5) | blue;
  ESP32_LCD_ILI9341_SPI::XY_Range(x0, y0, x1, y1);
  ESP32_LCD_ILI9341_SPI::CommandWrite( 0x2C ); //LCD RAM write
  ESP32_LCD_ILI9341_SPI::spiWriteBlock(ColorDot, repeat);
  if(!_Hw_cs) digitalWrite(_cs, HIGH);
}
//********* Display Color Pixel Block Fast Write *****************
void ESP32_LCD_ILI9341_SPI::spiWriteBlock(uint16_t color, uint32_t repeat) {
  uint16_t color16 = (color >> 8) | (color << 8);
  uint32_t color32 = color16 | color16 << 16;

  if (repeat > 15) {
    SET_PERI_REG_BITS(SPI_MOSI_DLEN_REG(_SPI_NUM), SPI_USR_MOSI_DBITLEN, 255,
                      SPI_USR_MOSI_DBITLEN_S);

    while (repeat > 15) {
      while (READ_PERI_REG(SPI_CMD_REG(_SPI_NUM)) & SPI_USR)
        ;
      for (uint32_t i = 0; i < 16; i++)
        WRITE_PERI_REG((SPI_W0_REG(_SPI_NUM) + (i << 2)), color32);
      SET_PERI_REG_MASK(SPI_CMD_REG(_SPI_NUM), SPI_USR);
      repeat -= 16;
    }
    while (READ_PERI_REG(SPI_CMD_REG(_SPI_NUM)) & SPI_USR)
      ;
  }

  if (repeat) {
    repeat = (repeat << 4) - 1;
    SET_PERI_REG_BITS(SPI_MOSI_DLEN_REG(_SPI_NUM), SPI_USR_MOSI_DBITLEN, repeat,
                      SPI_USR_MOSI_DBITLEN_S);
    for (uint32_t i = 0; i < 16; i++)
      WRITE_PERI_REG((SPI_W0_REG(_SPI_NUM) + (i << 2)), color32);
    SET_PERI_REG_MASK(SPI_CMD_REG(_SPI_NUM), SPI_USR);
    while (READ_PERI_REG(SPI_CMD_REG(_SPI_NUM)) & SPI_USR)
      ;
  }
}
//*********** 65k Color Pixel (Dot) Write ( SD card use )*************
void ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_DotColor_sd(uint16_t x0, uint16_t y0, uint16_t DotColor){
  ESP32_LCD_ILI9341_SPI::SPI_set_change();
  ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_DotColor(x0, y0, DotColor);
  if(!_Hw_cs) digitalWrite(_cs, HIGH);
}
//*********** 65k Color Pixel (Dot) Write ****************************
void ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_DotColor(uint16_t x0, uint16_t y0, uint16_t DotColor){
  ESP32_LCD_ILI9341_SPI::XY_Range(x0, y0, x0, y0);
  ESP32_LCD_ILI9341_SPI::CommandWrite( 0x2C ); //RAM write
  ESP32_LCD_ILI9341_SPI::DataWrite16( DotColor );
}
//*********** 65k Pixel RGB color Write ( SD card use )****************************
void ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_3Color_sd(uint16_t x0, uint16_t y0, uint8_t red, uint8_t green, uint8_t blue){
  ESP32_LCD_ILI9341_SPI::SPI_set_change();
  ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_3Color(x0, y0, red, green, blue);
  if(!_Hw_cs) digitalWrite(_cs, HIGH);
}
//*********** 65k Pixel RGB color Write ****************************
void ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_3Color(uint16_t x0, uint16_t y0, uint8_t red, uint8_t green, uint8_t blue){
  //red (0-31), green (0-63), blue (0-31)
  ESP32_LCD_ILI9341_SPI::XY_Range(x0, y0, x0, y0);

  uint16_t Dot = ((uint16_t)red << 11) | ((uint16_t)green << 5) | (uint16_t)blue;

  ESP32_LCD_ILI9341_SPI::CommandWrite( 0x2C ); //RAM write
  ESP32_LCD_ILI9341_SPI::DataWrite16( Dot );
}
//***************************************
void ESP32_LCD_ILI9341_SPI::Draw_Rectangle_Line(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint8_t red, uint8_t green, uint8_t blue){
  ESP32_LCD_ILI9341_SPI::Draw_Horizontal_Line(x0, x1, y0, red, green, blue);
  ESP32_LCD_ILI9341_SPI::Draw_Horizontal_Line(x0, x1, y1, red, green, blue);
  ESP32_LCD_ILI9341_SPI::Draw_Vertical_Line(x0, y0, y1, red, green, blue);
  ESP32_LCD_ILI9341_SPI::Draw_Vertical_Line(x1, y0, y1, red, green, blue);
}
//***************************************
void ESP32_LCD_ILI9341_SPI::Draw_Horizontal_Line(int16_t x0, int16_t x1, int16_t y0, uint8_t red, uint8_t green, uint8_t blue){
  if(x1 < x0) SWAP(int16_t, x0, x1);
  uint32_t Width_x = x1 - x0 + 1;
  ESP32_LCD_ILI9341_SPI::Block_SPI_Fast_Write(x0, y0, x1, y0, red, green, blue, Width_x);
}
//***************************************
void ESP32_LCD_ILI9341_SPI::Draw_Vertical_Line(int16_t x0, int16_t y0, int16_t y1, uint8_t red, uint8_t green, uint8_t blue){
  if(y1 < y0) SWAP(int16_t, y0, y1);
  uint16_t Width_y = y1 - y0 + 1;
  ESP32_LCD_ILI9341_SPI::Block_SPI_Fast_Write(x0, y0, x0, y1, red, green, blue, Width_y);
}
//***************************************
void ESP32_LCD_ILI9341_SPI::Draw_Line(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint8_t red, uint8_t green, uint8_t blue){
  ESP32_LCD_ILI9341_SPI::SPI_set_change();
  int i;
  int16_t Y = 0, X = 0;
  int16_t length_x = x1 - x0;
  int16_t length_y = y1 - y0;

  uint16_t Dot = (red << 11) | (green << 5) | blue;

  if(abs(length_x) > abs(length_y)){
    float degY = ((float)length_y) / ((float)length_x);
    if(x0 < x1){
      for(i=x0; i<(x1+1); i++){
        Y = y0 + round((i-x0) * degY);
        ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_DotColor(i, Y, Dot);
      }
    }else{
      for(i=x0; i>=x1; i--){
        Y = y0 + round((i-x0) * degY);
        ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_DotColor(i, Y, Dot);
      }
    }
  }else{
    float degX = ((float)length_x) / ((float)length_y);

    if(y0 < y1){
      for(i=y0; i<(y1+1); i++){
        X = x0 + round((i-y0) * degX);
        ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_DotColor(X, i, Dot);
      }
    }else{
      for(i=y0; i>=y1; i--){
        X = x0 + round((i-y0) * degX);
        ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_DotColor(X, i, Dot);
      }
    }
  }
  if(!_Hw_cs) digitalWrite(_cs, HIGH);
}
//***************************************
void ESP32_LCD_ILI9341_SPI::Draw_Rectangle_Fill(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint8_t red, uint8_t green, uint8_t blue){
  uint16_t Width_x = x1 - x0 + 1;
  uint16_t Width_y = y1 - y0 + 1;
  uint32_t Total = Width_x * Width_y ;
  ESP32_LCD_ILI9341_SPI::Block_SPI_Fast_Write(x0, y0, x1, y1, red, green, blue, Total);
}
//***************************************
void ESP32_LCD_ILI9341_SPI::Draw_Circle_Line(uint16_t x0, uint16_t y0, uint16_t r, uint8_t red, uint8_t green, uint8_t blue){
  ESP32_LCD_ILI9341_SPI::SPI_set_change();
  uint16_t x1, y1;
  float i;
  float deg = 1.0;
  if( r > 50 ) deg = 0.5;
  if( r > 110) deg = 0.25;

  uint16_t Dot = ((uint16_t)red << 11) | ((uint16_t)green << 5) | (uint16_t)blue;
  int16_t dummy_x = -1, dummy_y = -1;

  for(i=0; i<360; i=i+deg){
    x1 = round( (float)(x0 + (r * cos(radians(i)))) );
    y1 = round( (float)(y0 + (r * sin(radians(i)))) );

    if((dummy_x != x1) || (dummy_y != y1)){
      ESP32_LCD_ILI9341_SPI::Draw_Pixel_65k_DotColor(x1, y1, Dot);
      dummy_x = x1;
      dummy_y = y1;
    }
  }
  if(!_Hw_cs) digitalWrite(_cs, HIGH);
}
//***************************************
void ESP32_LCD_ILI9341_SPI::Draw_Circle_Fill(uint16_t x0, uint16_t y0, uint16_t r, uint8_t red, uint8_t green, uint8_t blue){
  //red (0-31), green (0-63), blue (0-31)
  uint16_t x1, y1;
  float i;
  float deg = 1.0;
  //半径が大きくなると、角度の刻み方を細かくしないと、完全に塗りつぶせないので注意。
  if( r > 50 ) deg = 0.5;
  if( r > 110) deg = 0.25;

  int16_t dummy_x = -1, dummy_y = -1;
  for( i = 0; i < 360; i = i + deg ){
    x1 = round( (float)(x0 + (r * cos(radians(i)))) );
    y1 = round( (float)(y0 + (r * sin(radians(i)))) );
    if((dummy_x != x1) || (dummy_y != y1)){
      ESP32_LCD_ILI9341_SPI::Draw_Vertical_Line(x1, y0, y1, red, green, blue);
      dummy_x = x1;
      dummy_y = y1;
    }
  }
}
//********* LCD Display LED Brightness **************
void ESP32_LCD_ILI9341_SPI::Brightness(uint8_t brightness){
  uint8_t ledc_ch = 0;
  ledcSetup(ledc_ch, 5000, 8);
  ledcAttachPin(_ledpin, 0);
  ledcWrite(ledc_ch, brightness);
}
